---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.Dispose
source: html/ebe006df-3b70-5c5f-c188-c30e3ba723d2.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.Dispose Method

Releases all resources used by the RebarUpdateCurvesData

## Syntax (C#)
```csharp
public void Dispose()
```